package by.htp.krozov.helloworld; //Описание пакета в котором, располагается ваш класс.

public class Main { //Задание класса. Имя класс должно совпадать с именем файла в котором он описан.

    public static void main(String[] args) { //Точка запуска вашего приложения.

        System.out.println("Hello, HTP!"); //Вывод строки "Hello, HTP!"
                                           // в станартный вывод (консоль) с добавлением перехода
                                           // на новую строку
    }
}
